app/controllers/registrations_controller.rb

	def create
	    #complete this method
		user = User.new(name: params[:registrations][:name],
										last_name: params[:registrations][:last_name],
										email: params[:registrations][:email],
										password: params[:registrations][:password],
										)

		if user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2019-04-17 13:59:48.596100"], ["updated_at", "2019-04-17 13:59:48.596100"]]