app/controllers/sessions_controller.rb

	def create
		#complete this method
		input_email = params[:session][:email]
		input_password = params[:session][:password]

		user = User.where(email:input_email,password: input_password)[0]
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ?  [["email", "macanepa@miuandes.cl"], ["password", ""]]