app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if (user.save)
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "last_name" = ?, "email" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Maximiliano"], ["last_name", "Garciaa"], ["email", "mrgarcia1@miuandes.cl"], ["phone", "987654321"], ["updated_at", "2019-04-17 16:50:49.226805"], ["id", 5]]